Archivos/app/Controllers/Consulta_controller.php

SELECT *
FROM `consultas`
ORDER BY `id_persona` ASC
---
    public function ver_consulta(){
        $consulta_model = new Consulta_model();
        $data['titulo'] = 'Consultas';
        $data['consultas'] = $consulta_model->orderBy('id_persona','asc')->findAll();