Archivos/app/Controllers/producto_crud_controller.php

	public function index(){
		$ProductoModel = new Producto_model();
		$data['productos']=$ProductoModel ->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC