Archivos/app/Controllers/usuario_crud_controller.php

	public function index(){
		$userModel = new Usuario_model();
		$data['users']=$userModel ->orderBy('id_usuario', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` DESC

	public function create(){
		$userModel =new Usuario_model();
		$data ['user_obj']=$userModel ->orderBy('id_usuario', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` DESC

	public function singleUser($id=null){
		$userModel =new Usuario_model();
		$data ['old']=$userModel ->where('id_usuario', $id)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '59'
 LIMIT 1